224 166
224 167
32 256
256 190
256 176
257 141
257 135
259 256
261 256
256 191
265 256
260 258
175 256
262 256
262 258
268 188
256 168
257 129
256 164
261 260
256 178
256 149
257 128
256 172
259 258
262 267
164 258
256 271
256 174
224 165
260 264
257 139
263 168
264 175
258 184
256 184
258 172
258 149
259 260
266 149
285 282
258 170
256 170
264 164
256 159
259 267
256 166
256 130
44 258
265 258
256 185
256 151
32 257
32 32
263 178
264 172
263 271
264 159
256 182
257 130
257 131
258 174
266 271
258 143
269 182
256 163
263 172
257 166
263 184
263 149
263 174
285 164
256 167
269 168
266 168
170 275
185 283
293 260
256 135
167 257
258 133
256 173
263 166
258 166
279 303
264 166
266 164
266 178
264 183
264 268
297 275
258 168
263 164
256 156
266 172
269 149
263 130
258 182
258 134
270 172
266 184
266 282
278 283
256 154
327 10
256 188
161 361
269 155
309 309
256 165
273 276
258 185
263 151
256 183
263 156
263 183
262 296
258 147
258 176
266 182
32 40
269 178
259 286
264 165
263 185
308 335
264 154
352 276
262 260
270 170
258 156
270 184
277 344
266 183
175 257
258 173
269 150
286 172
149 260
300 305
270 143
281 184
266 174
258 164
265 267
319 340
316 274
258 151
256 150
226 128
263 170
258 137
264 282
264 167
165 351
258 150
338 320
263 135
256 362
273 260
257 335
257 136
263 167
256 137
274 299
286 164
290 284
281 174
264 168
264 161
32 10
153 264
264 170
133 272
256 155
300 265
280 332
175 273
278 267
258 135
156 272
261 267
328 289
296 143
323 323
256 147
278 272
280 172
143 340
308 168
291 379
257 168
427 151
284 288
256 158
264 149
364 364
278 274
256 171
265 260
266 166
281 172
289 288
258 332
383 412
294 274
302 409
270 134
258 410
258 154
290 310
269 172
258 178
143 277
277 299
272 299
270 174
262 304
322 341
266 156
294 321
287 298
264 160
286 174
270 331
257 140
266 173
270 166
280 184
375 311
297 260
266 159
263 182
273 272
287 307
307 366
389 313
266 170
368 260
263 154
270 149
290 303
256 448
165 325
315 393
270 164
272 341
263 362
263 165
313 275
337 322
264 178
269 164
263 163
258 167
269 135
155 343
269 271
450 382
287 276
275 295
286 165
316 365
175 312
381 390
269 159
270 133
270 168
263 159
266 185
281 170
269 183
307 275
345 172
319 277
256 160
264 174
256 143
257 142
298 275
317 273
257 171
137 298
266 154
518 350
44 292
411 275
357 332
263 147
273 369
336 272
269 174
281 331
257 167
262 360
287 272
281 149
258 175
419 260
259 304
328 288
514 276
260 277
263 129
266 163
175 490
306 324
286 163
311 278
316 369
356 299
291 451
301 184
283 363
280 394
353 274
173 371
315 276
280 170
257 174
554 477
273 274
436 289
273 302
257 169
281 133
32 405
265 292
274 525
273 267
363 343
388 560
371 505
329 296
257 172
542 492
349 350
330 424
269 147
173 461
270 137
162 325
274 295
416 390
257 170
301 172
270 182
272 333
275 278
287 300
258 171
264 184
256 161
269 184
291 284
356 467
270 176
266 130
270 151
281 166
257 173
420 267
423 438
404 289
396 277
591 474
260 321
391 371
300 313
491 287
564 298
407 298
273 284
280 331
44 290
270 499
256 134
365 284
584 324
41 10
304 175
291 303
279 446
44 293
314 318
277 408
303 314
540 434
528 326
280 166
301 174
441 283
314 382
315 298
336 557
562 494
171 276
270 175
269 156
349 272
536 592
289 310
258 152
291 276
281 168
280 185
367 276
648 398
264 156
301 170
275 284
345 174
386 272
372 143
346 274
321 425
566 288
258 159
422 283
258 512
291 299
280 174
347 326
452 452
352 314
280 149
270 154
266 155
380 342
294 278
277 310
281 134
279 341
318 272
278 279
286 268
624 644
392 656
482 593
325 672
339 320
411 377
279 421
264 155
280 519
433 470
266 151
280 147
263 173
265 286
374 370
296 172
683 273
359 382
315 274
315 563
544 283
315 284
308 167
558 294
389 478
292 430
284 384
396 340
567 402
329 341
385 260
280 168
156 348
684 289
288 299
316 306
265 290
417 598
274 289
292 276
445 323
286 151
287 369
280 444
256 561
258 161
264 158
288 545
272 729
32 34
263 150
176 370
280 134
273 279
308 169
718 295
301 331
379 288
301 149
403 275
292 485
273 283
273 334
306 412
296 164
287 283
529 306
433 307
264 173
266 137
439 334
266 147
272 424
345 164
259 10
263 282
269 166
44 297
345 149
385 294
256 152
306 260
270 156
367 611
266 150
311 294
333 432
276 507
290 326
315 306
510 479
418 667
458 425
295 292
279 456
269 170
280 133
286 149
378 149
391 461
292 460
405 153
281 182
280 182
284 272
281 578
267 172
319 334
274 305
288 408
257 175
304 174
458 289
691 168
320 272
287 277
265 293
45 533
278 260
292 383
301 394
289 324
270 135
433 462
265 297
267 174
284 428
295 344
296 184
270 429
265 393
324 272
262 327
486 350
348 275
287 260
547 272
166 320
471 275
273 291
284 283
363 372
269 161
281 469
450 664
329 313
357 394
284 274
571 474
170 260
559 302
657 283
404 272
415 273
150 377
637 619
582 152
380 330
289 406
779 392
266 167
308 171
263 155
286 175
267 184
374 569
281 429
565 313
281 164
330 305
431 292
101 32
273 256
265 304
298 260
311 260
495 442
256 133
308 170
263 160
300 295
440 323
418 442
447 323
258 155
701 260
805 408
516 521
421 449
316 462
174 651
330 341
143 334
343 689
286 183
275 287
301 168
359 699
274 284
356 313
418 476
300 400
279 359
277 276
274 771
281 538
419 272
272 409
473 175
353 688
336 279
301 166
435 576
321 333
658 300
263 161
97 110
296 174
264 163
270 185
356 322
291 313
272 453
339 276
366 287
336 517
270 173
297 500
328 345
260 295
280 151
430 503
298 500
302 288
273 277
319 640
328 295
330 299
822 495
422 428
318 288
281 137
287 328
265 10
291 289
273 298
392 288
267 166
396 334
529 446
269 151
280 154
738 288
326 278
304 164
358 290
464 262
786 843
266 161
339 626
894 513
297 695
347 318
277 402
698 278
287 284
44 32
270 147
374 588
420 260
268 166
286 182
346 312
375 527
342 275
278 307
327 520
471 286
256 175
293 344
416 174
305 147
370 289
311 874
346 556
336 642
304 134
135 634
305 185
334 272
431 290
508 275
291 279
454 516
522 638
297 415
610 781
308 173
530 395
270 178
721 275
381 174
420 311
308 172
279 380
386 348
280 164
270 171
397 504
270 595
293 287
281 151
671 276
265 333
272 570
276 325
565 478
301 133
376 599
258 597
115 116
420 284
445 440
101 114
534 298
263 137
280 176
278 302
278 277
296 134
510 260
526 260
355 460
277 275
297 878
267 170
305 166
303 260
339 273
349 348
273 470
301 134
305 174
339 587
413 272
380 278
337 371
727 1013
421 272
296 149
278 276
757 503
289 524
329 360
270 167
291 505
337 368
427 149
417 260
301 578
267 168
306 449
405 147
317 306
281 154
111 114
415 577
929 273
325 402
256 129
1029 654
579 275
690 272
969 724
258 499
378 165
497 720
289 294
274 287
111 110
333 372
405 157
260 279
722 539
280 156
176 1053
314 801
287 279
468 967
371 313
317 739
342 311
278 284
304 444
318 259
296 170
108 101
260 441
256 131
433 641
264 331
267 134
343 428
280 572
1081 437
348 437
273 404
354 747
405 140
292 320
307 515
116 104
277 488
400 174
302 320
135 576
44 873
736 289
659 398
115 32
305 444
469 395
284 311
279 312
378 154
287 291
317 651
328 489
357 185
279 306
45 279
509 475
45 599
359 276
531 272
582 156
279 276
387 303
612 569
732 416
305 168
339 392
108 105
389 283
751 306
621 384
280 410
355 276
404 288
620 395
447 440
275 487
310 295
386 276
272 425
381 171
571 680
297 663
357 172
399 330
358 292
353 773
302 760
288 279
137 617
270 519
287 286
308 174
292 417
378 174
151 275
339 318
273 462
585 1077
273 300
311 342
296 331
314 840
1123 289
293 276
551 287
883 273
263 158
260 454
279 460
471 604
337 266
407 617
443 485
307 274
290 306
290 749
310 278
274 272
400 184
669 334
293 708
274 489
305 134
274 716
302 626
322 276
384 273
379 406
753 294
1065 295
288 287
354 276
290 715
350 320
97 114
105 110
291 302
717 260
263 153
263 448
463 291
286 173
287 608
276 784
540 278
342 299
274 311
289 325
528 306
302 936
134 747
439 923
280 178
465 692
304 168
267 133
273 641
267 149
279 338
298 273
262 376
150 272
336 638
295 506
259 45
257 390
283 272
305 572
290 725
1058 311
258 759
381 172
765 284
277 622
97 116
659 326
281 185
168 299
281 173
378 184
310 283
851 1109
272 379
333 329
289 312
1119 295
289 326
272 295
278 449
314 1037
324 299
562 368
546 804
262 32
288 907
339 777
351 344
714 323
273 414
790 330
194 160
297 643
290 494
298 711
305 133
275 974
1047 377
276 428
339 295
647 945
693 1165
287 359
355 383
281 156
287 306
337 713
877 588
527 313
167 479
32 58
423 783
298 365
418 295
515 272
397 303
345 184
280 175
283 278
391 315
662 287
280 429
301 185
594 283
373 292
337 461
304 154
670 716
304 143
817 438
849 278
1277 1080
114 111
1227 836
259 426
615 295
259 296
1143 375
262 44
333 274
475 944
975 274
175 323
266 143
279 498
548 556
864 519
1323 278
571 277
363 550
277 685
758 402
314 277
304 133
304 166
930 272
391 713
502 1291
346 633
272 312
100 32
679 679
304 156
589 164
458 313
887 274
378 172
646 438
286 167
387 284
734 478
265 46
152 300
480 312
542 891
997 358
367 324
287 349
317 885
97 99
1078 882
315 855
259 376
1206 310
277 294
758 812
373 290
734 321
273 307
275 269
482 368
962 763
263 157
277 573
302 278
520 173
455 934
367 912
304 182
545 478
730 338
305 332
287 337
304 135
260 324
10 124
712 700
665 260
631 372
10 32
293 284
307 321
963 272
268 1229
661 276
381 173
413 276
421 316
280 143
787 310
365 289
1237 1271
397 832
401 292
436 847
369 910
270 597
359 966
1060 295
579 437
381 168
281 652
319 1007
1161 288
293 879
354 279
724 358
1174 382
45 298
573 274
342 437
272 289
286 168
355 485
697 1043
574 260
443 276
311 272
780 1273
280 137
305 176
301 182
101 110
269 154
278 292
283 351
265 346
304 176
487 294
486 539
296 182
1414 276
367 274
312 292
397 284
704 333
286 436
275 577
166 295
258 144
273 733
291 326
369 313
357 184
710 275
301 151
546 351
825 1040
347 705
267 331
510 476
302 341
586 329
406 288
314 492
337 765
317 755
628 1004
274 273
756 279
468 388
297 302
325 344
327 32
928 680
270 394
660 326
397 498
301 137
535 318
721 437
176 588
372 172
892 274
850 277
434 174
1075 342
265 426
354 283
302 312
435 898
117 110
279 383
381 170
852 288
339 330
281 743
686 442
256 1049
472 273
311 295
395 174
385 643
385 414
407 764
167 476
260 278
292 694
322 289
398 509
272 326
432 360
259 534
97 108
265 41
284 760
105 1071
355 694
269 185
402 311
403 321
378 268
290 558
1167 358
297 393
413 300
284 1177
582 147
1274 318
301 154
261 1100
501 330
298 415
290 329
305 164
262 541
320 318
105 99
548 633
348 299
274 275
353 306
849 434
328 479
549 323
351 607
101 101
288 313
281 979
867 649
270 152
661 611
263 171
305 182
546 831
706 740
256 157
279 274
305 156
343 957
875 416
274 276
435 634
279 899
920 759
301 429
270 332
546 1324
1022 272
279 289
367 370
426 426
355 320
304 185
770 299
559 359
354 430
609 313
354 985
272 813
300 276
668 847
301 178
352 720
568 504
471 437
484 725
372 164
439 277
399 338
287 449
314 823
1115 273
504 284
389 451
497 1204
292 733
378 161
318 326
266 171
378 159
604 414
315 260
376 972
32 45
350 324
480 274
280 469
301 652
347 283
821 351
567 294
547 311
984 324
317 288
581 328
818 789
931 789
101 115
352 277
315 359
344 839
402 289
481 260
267 410
265 479
293 476
374 359
534 291
400 172
399 294
365 279
296 595
745 338
286 152
290 311
344 983
451 366
353 819
111 102
266 131
1016 420
326 276
284 509
354 284
263 175
293 479
481 1102
166 492
291 272
566 402
830 321
279 272
435 272
814 576
329 356
339 754
835 395
284 781
354 307
297 310
262 41
1636 32
737 276
347 1332
292 941
349 738
272 1201
367 889
1171 654
387 393
317 438
296 133
396 291
374 649
520 390
477 418
414 318
301 538
287 414
294 277
602 845
302 295
293 1394
702 274
317 1267
277 666
258 815
312 1083
37 41
375 272
467 278
325 299
1219 544
705 173
363 329
431 293
45 284
256 1091
267 164
267 185
398 424
298 299
299 1209
293 1556
312 272
280 150
401 290
260 370
483 320
298 388
275 288
1577 1544
310 1192
400 331
951 1310
372 184
481 462
1673 1252
167 260
347 259
262 848
270 155
135 898
1366 163
265 376
273 321
275 324
292 1135
277 607
304 151
286 519
296 166
312 278
333 589
290 313
273 349
269 173
295 287
385 500
275 318
565 910
280 173
286 166
302 289
301 444
378 167
291 311
312 277
431 297
267 151
292 885
752 949
268 1245
602 693
353 693
44 346
1166 1128
270 846
58 32
825 320
1709 295
312 1464
275 306
707 460
484 303
291 1546
400 149
367 272
279 1491
465 276
268 165
276 277
260 453
623 312
459 360
291 306
314 1042
121 32
455 1164
634 295
508 1516
302 276
298 274
154 692
32 39
353 470
509 278
288 1196
297 288
1012 121
1787 1088
1788 61
304 171
531 543
509 425
317 272
287 709
267 394
353 823
523 318
302 618
1488 100
428 329
334 576
429 351
338 288
403 414
959 531
421 1365
270 538
356 303
176 569
552 854
971 983
296 168
387 326
539 699
111 108
549 466
517 740
556 278
1093 307
552 476
1178 175
284 826
277 313
269 171
266 135
302 330
677 755
262 445
322 338
354 981
573 277
391 368
346 506
610 283
260 274
497 619
401 399
1018 569
531 603
355 482
45 924
296 137
287 1553
10 679
596 531
579 516
502 437
46 537
289 1616
353 845
1092 1486
354 260
1353 330
292 456
761 300
273 328
527 321
486 389
376 416
269 282
103 1309
311 277
790 872
98 1356
259 541
284 1097
404 671
295 488
407 709
564 955
304 173
280 512
413 260
327 426
488 406
1875 488
299 260
273 449
374 742
45 277
422 370
298 800
455 388
281 178
350 1430
167 294
455 1048
525 424
508 273
270 436
986 342
456 409
392 1853
373 283
473 164
366 1336
290 279
501 861
419 617
1105 438
266 165
378 182
32 1789
1903 34
1904 1864
1905 107
1906 1861
1907 1799
1908 58
59 34
1910 124
280 135
616 466
281 572
270 161
284 755
446 288
276 594
265 360
333 550
548 274
367 647
1580 295
287 655
280 499
381 167
536 1110
337 283
373 346
864 129
502 260
270 512
971 839
317 324
406 1822
583 485
483 392
1708 607
1461 289
493 388
336 337
307 1347
411 288
296 175
405 148
306 273
791 358
417 276
1025 318
497 446
273 395
406 299
459 586
270 159
378 178
493 1770
533 640
267 182
260 322
434 184
287 274
293 551
354 306
280 538
365 1293
917 740
312 274
289 577
1518 149
286 156
463 279
270 150
290 1195
746 323
286 170
298 348
194 176
265 45
386 1064
381 169
375 310
794 527
423 1070
473 143
723 318
302 587
345 170
336 388
263 561
274 726
307 260
399 1050
881 816
281 436
275 891
483 587
256 597
1158 159
346 321
370 295
346 1031
398 288
293 279
256 815
275 370
844 441
32 83
596 617
710 1862
277 398
276 287
429 804
259 360
613 1169
1300 432
298 1264
357 149
166 587
369 532
347 475
1551 294
293 294
423 274
414 277
339 322
1612 442
560 274
294 806
376 279
407 961
422 1063
598 666
646 783
612 370
520 174
413 279
315 349
1351 474
1044 610
2039 458
413 608
403 515
682 692
174 1259
10 33
1067 277
346 868
435 1377
333 700
324 1655
302 380
293 310
435 1062
386 377
1644 295
858 1240
484 284
301 469
173 368
457 320
279 321
256 701
403 337
502 275
465 842
1965 1451
637 736
1700 1224
288 425
302 275
1821 288
301 164
267 156
260 312
260 392
354 1197
537 466
272 313
334 317
468 392
373 317
345 151
1364 570
134 279
731 432
363 262
291 408
301 147
290 859
305 178
520 172
322 272
727 534
305 143
348 532
464 355
334 283
263 1049
353 1094
517 914
269 158
435 1243
748 633
1590 295
818 288
347 508
539 294
269 362
289 368
445 537
750 476
702 275
575 466
1560 273
1103 863
1341 1863
1542 1735
288 289
518 277
1642 289
530 334
373 399
541 460
259 41
278 1631
305 154
463 276
290 1634
256 469
265 296
462 274
705 1645
496 551
46 32
334 277
386 1266
289 767
1107 358
329 607
682 276
358 297
422 760
267 444
406 408
291 294
258 1284
360 279
307 424
293 1262
481 1061
274 2066
105 116
264 171
33 33
291 494
467 275
357 168
290 393
639 1059
368 366
274 1582
2051 622
274 288
354 272
380 2120
430 260
391 322
133 557
401 317
483 513
1660 294
402 358
368 916
802 466
260 284
288 333
296 156
540 453
354 1308
279 294
324 451
114 101
290 1462
284 1004
888 326
292 1175
298 643
290 1342
495 289
2156 1196
1180 949
508 771
360 632
354 291
374 1096
534 1494
472 739
264 436
305 137
480 633
627 1370
1002 431
950 493
520 170
367 279
860 1144
281 176
906 272
337 710
931 302
303 291
339 513
323 466
1465 517
838 432
345 1445
475 1295
1975 827
555 174
283 291
1254 428
372 170
877 1096
871 326
317 274
547 867
366 375
168 326
97 115
276 295
45 635
521 275
682 842
555 134
498 453
717 1027
468 776
388 289
526 500
345 168
350 421
273 1110
388 321
354 302
260 649
1328 459
385 695
278 347
876 503
856 504
994 594
346 1104
284 1098
726 260
980 276
501 325
364 1844
1016 338
1990 516
603 432
378 183
277 355
464 511
277 260
404 276
956 686
329 439
1136 905
267 147
287 302
291 337
310 272
378 175
495 699
304 178
488 318
366 367
419 300
48 48
987 1608
1379 318
1333 295
523 475
45 416
262 741
395 134
295 314
517 1509
267 173
1806 475
939 1329
293 992
100 105
277 496
1680 277
1536 1497
1814 593
262 630
1121 1637
2299 2067
290 1256
292 1170
776 2137
2261 295
1501 1234
917 914
274 259
717 1819
850 278
1720 689
2218 806
304 147
345 1245
678 1483
483 754
280 846
706 1257
628 1194
292 1039
443 460
706 289
543 360
557 295
324 277
350 1040
272 279
787 313
355 1885
533 291
305 410
613 279
422 532
638 288
374 392
297 1383
1191 288
301 176
463 430
614 321
397 952
1701 1435
924 474
722 2027
1750 275
284 532
1823 1079
465 310
267 652
1158 161
273 535
279 1857
2150 430
280 171
834 2028
10 291
399 325
274 830
105 1012
2281 1860
260 287
548 312
904 358
965 333
890 310
1010 169
317 1259
346 1357
1213 295
493 415
357 134
304 595
317 343
400 133
468 807
445 549
334 634
537 323
384 441
1154 710
631 550
262 59
552 1633
501 515
459 363
354 349
304 137
457 1039
347 481
772 276
780 921
46 447
333 363
287 314
996 295
675 329
615 777
581 642
546 1376
604 2019
609 715
279 324
788 1443
590 466
109 101
1139 432
101 108
10 279
301 156
1858 302
1521 2364
154 842
1593 2010
167 466
354 1334
293 370
447 466
277 387
293 1172
570 432
805 299
295 300
256 429
434 170
269 448
284 573
877 974
442 341
329 553
281 152
337 402
1510 32
844 287
353 1721
395 151
311 283
10 632
293 1432
395 133
353 380
403 916
10 2300
457 1776
339 1329
454 276
266 561
318 324
1030 733
840 453
329 401
322 295
260 288
522 337
300 277
273 314
434 172
384 318
1936 949
413 277
378 173
675 287
283 1924
2224 287
1622 509
270 561
359 1847
117 114
315 369
353 1278
347 761
273 592
465 442
336 1525
1069 350
574 643
481 1114
2475 277
1382 1909
314 1325
2046 289
274 1829
520 171
314 527
297 1008
400 170
292 414
678 277
301 743
1808 772
613 306
858 804
676 322
345 158
2492 2198
314 289
375 492
1242 1513
553 828
347 1189
1133 700
538 260
41 401
46 1386
908 1337
342 355
667 288
46 575
1041 1059
422 1851
357 512
148 298
301 173
968 173
46 600
379 276
349 276
292 259
263 652
482 1247
1976 310
272 278
494 295
329 327
286 159
374 377
289 495
676 273
45 869
1134 103
999 377
2135 521
1178 561
257 183
698 453
629 274
378 166
1458 320
290 1084
403 516
290 368
2412 935
758 294
293 365
435 502
401 319
328 1424
336 1628
397 326
376 632
336 328
278 10
614 531
445 580
317 1416
359 842
274 387
388 284
744 279
277 385
279 320
659 449
510 294
267 137
347 511
376 970
290 895
1674 1500
305 512
306 1967
480 1191
291 274
496 370
2101 664
334 291
636 828
306 272
399 365
298 585
589 172
297 1728
653 712
404 770
1496 592
330 265
304 159
1279 272
857 372
2518 487
487 1855
1179 1218
272 532
668 1476
498 276
281 147
262 769
429 2216
897 260
343 425
156 276
2005 343
45 632
348 316
526 663
497 307
403 288
367 1173
286 154
612 742
357 170
1215 622
751 1250
855 338
615 587
373 347
272 504
1415 663
368 274
501 338
292 1362
302 963
467 276
400 166
395 168
333 1051
1296 1867
328 529
331 556
1145 1589
259 639
289 273
267 143
339 467
366 413
353 527
1120 272
329 322
737 356
279 2309
480 556
976 1523
277 421
487 808
1348 284
360 291
596 764
274 385
397 393
336 274
272 292
398 1155
534 984
404 377
10 10
330 409
333 719
305 151
276 487
886 321
860 1896
396 640
325 288
349 944
283 1185
723 326
555 175
303 619
811 1095
46 590
456 1389
918 368
294 291
277 274
367 294
355 414
272 265
549 621
272 1472
387 1613
496 708
1056 513
305 173
259 34
259 630
426 32
103 99
308 390
260 588
1567 294
2445 342
687 307
402 299
375 1184
1052 326
435 1146
1436 310
298 695
473 444
267 469
535 343
1963 284
795 773
314 284
533 334
260 298
262 746
278 886
310 313
481 314
304 469
293 275
384 445
403 813
580 466
552 879
289 742
334 386
293 1598
600 466
284 837
768 384
413 349
377 272
2536 289
481 328
359 692
1599 1214
596 1249
403 1126
494 716
1125 272
388 787
269 137
372 149
340 314
2240 408
1878 295
375 382
491 342
911 279
292 965
292 498
266 448
258 160
292 880
876 605
1768 1285
354 1074
446 342
1092 598
473 134
312 321
84 104
1338 1338
347 1371
1373 278
535 274
1682 2171
559 414
157 414
290 1217
431 976
457 694
311 2211
424 274
674 686
529 291
350 456
274 532
1656 913
994 322
489 2074
376 291
404 458
317 1393
307 836
2642 1348
349 664
267 176
267 841
2707 276
913 2588
625 1306
1162 306
260 785
266 331
386 1410
45 1142
293 1505
277 406
97 32
1620 337
290 511
606 275
920 271
497 277
337 294
294 45
752 2004
384 585
98 2684
2799 1815
2800 1057
2801 61
443 383
305 429
423 605
698 449
480 868
314 358
357 147
417 1255
1079 377
349 1295
312 307
292 1314
58 10
1230 288
705 829
320 1887
423 573
284 310
307 437
318 284
155 605
2257 452
780 1846
1968 749
281 1401
333 430
290 294
293 1969
395 829
434 182
584 289
464 385
399 861
530 655
387 749
1530 322
270 410
294 377
347 685
314 1497
407 1249
1121 712
987 545
301 143
292 1571
293 565
292 566
166 276
1025 801
465 1032
300 1825
520 169
620 431
281 159
1017 276
543 296
281 846
329 318
1302 358
306 325
627 1803
317 502
111 100
472 1032
887 306
276 654
286 161
277 287
262 1127
2359 2310
279 322
326 837
343 493
1099 288
435 554
1800 358
902 2394
766 124
337 481
263 572
604 277
407 851
991 392
288 288
265 32
337 315
306 343
289 504
809 2291
626 1310
923 544
357 331
1840 641
292 1367
355 417
355 880
176 649
259 32
305 171
291 428
1585 334
297 871
446 406
1198 459
272 310
314 819
354 1089
1133 489
111 109
291 725
599 173
294 456
422 881
468 742
1292 619
859 1378
1446 1777
473 174
668 1942
794 823
372 174
536 2070
151 414
475 283
274 631
645 513
308 175
266 134
290 504
1487 689
317 826
416 171
279 485
853 323
1648 1248
291 1617
310 274
337 2313
568 832
281 143
387 952
397 1217
301 829
986 357
606 1754
942 916
702 366
50 2279
1015 32
108 111
101 116
294 10
1002 2105
273 624
496 284
1124 173
275 398
627 1216
348 330
258 165
386 690
477 288
1353 2519
290 1358
1078 2044
1343 2881
275 2369
274 770
292 1360
305 135
390 140
277 463
937 408
387 504
535 868
552 365
2162 1763
543 586
709 476
379 342
268 499
2983 666
265 44
530 862
743 289
925 333
328 294
99 116
399 279
459 833
330 278
290 428
795 845
1230 342
347 302
431 346
1026 172
483 273
276 272
596 851
501 1050
363 669
423 1369
353 343
2142 1554
296 841
2510 1664
493 507
266 815
472 1116
513 338
447 549
292 325
743 1257
280 152
714 440
353 375
294 284
814 1062
464 387
1487 2587
660 1778
629 2336
260 351
273 306
691 159
413 283
1174 664
2151 2441
418 272
325 854
483 276
1151 265
413 284
2079 1116
300 343
454 275
279 1417
276 398
73 110
278 563
635 290
2232 477
2656 272
526 288
491 1900
606 1381
920 184
278 291
3051 2964
330 1211
468 2061
2236 500
1134 2404
369 478
326 288
486 1506
400 841
1602 278
744 1334
676 1083
407 1625
333 586
275 492
522 279
553 490
290 1877
283 490
864 157
265 778
555 133
279 2427
376 256
284 289
291 471
355 563
1515 1889
629 312
980 611
391 310
298 302
1170 295
2258 272
387 832
743 740
325 451
281 884
292 1849
46 616
317 1155
764 1234
275 524
281 150
439 395
472 343
483 1447
459 1805
336 2071
1458 330
548 506
283 276
463 272
914 2766
1046 479
347 513
772 300
590 323
422 1406
262 870
399 1935
1121 366
46 549
327 1014
270 572
313 294
310 603
1856 628
301 436
373 919
555 168
581 279
453 276
673 275
539 310
283 302
275 326
497 1226
151 515
1117 329
159 275
1402 279
398 1248
1349 272
296 1368
417 1939
397 1318
298 767
281 171
330 1745
354 277
602 1278
428 295
295 377
329 425
283 837
2956 287
407 302
614 414
2723 415
401 297
378 168
2473 932
258 1390
1160 1939
273 359
480 996
3045 3046
1009 517
2875 1036
407 1154
2042 1743
3056 1911
280 595
612 588
45 334
583 383
858 351
287 1061
665 500
297 2420
373 354
857 550
426 1176
274 310
604 276
303 277
1769 348
589 149
1584 279
304 597
896 372
380 503
484 2251
385 663
796 277
625 274
185 276
357 174
480 1104
403 1839
954 284
363 719
336 928
297 414
67 104
1203 103
46 46
489 341
346 1405
275 937
1209 819
403 274
732 972
504 406
3206 708
260 456
400 134
290 299
1588 295
265 541
523 1189
327 993
374 1587
280 884
468 704
1033 307
3009 295
1046 810
3010 279
317 294
329 2840
435 283
166 754
1657 603
717 798
294 441
937 299
2641 2311
46 580
446 276
551 1533
1345 449
169 466
348 604
260 380
262 853
294 376
1376 288
355 456
468 1442
305 175
276 1036
182 1094
834 763
302 366
288 341
650 10
339 1688
511 292
385 2352
2653 273
373 293
105 115
111 32
2751 863
269 129
653 288
645 392
291 273
1044 613
415 567
2277 277
272 607
834 1595
295 1210
328 493
3268 730
99 104
294 1211
1859 1319
459 631
673 1652
346 1949
2773 41
388 1289
293 2775
317 2117
555 164
645 587
707 383
437 172
290 952
380 294
480 506
267 429
401 293
411 745
748 556
259 793
339 289
636 938
1125 342
457 1873
920 331
434 331
346 2430
353 1948
353 726
391 593
419 298
295 1275
290 892
312 346
279 563
589 184
311 324
2063 810
297 2131
312 399
305 469
400 137
348 355
727 617
296 173
1477 394
1010 170
262 1372
370 294
2393 325
300 342
291 628
305 150
319 1140
702 916
403 498
470 2691
144 1777
373 297
304 150
1496 1110
1678 333
284 564
326 532
1381 260
339 454
275 283
322 351
445 590
337 2368
268 182
1003 414
272 1214
445 600
330 318
666 279
732 1541
768 272
545 313
304 161
488 2907
1481 506
761 272
599 390
372 134
3119 1097
1892 801
455 274
155 503
260 273
326 310
372 133
391 2055
416 173
418 366
273 608
530 277
748 274
2714 289
262 639
468 1036
1689 272
2467 321
507 322
400 168
737 2112
279 1317
2793 272
358 346
302 294
317 330
305 829
1663 312
135 1062
1902 1255
726 358
292 1959
314 2860
483 322
2968 284
417 272
301 979
185 611
627 1916
811 1583
585 184
423 288
355 1610
1423 432
3296 2189
281 394
3177 1495
343 521
114 105
1006 432
354 1253
348 289
417 1404
472 605
349 312
291 498
455 649
339 311
417 274
1154 279
530 431
491 2255
445 575
622 333
661 889
407 1928
44 741
870 323
360 869
114 97
1331 587
386 283
375 1042
1501 274
314 1444
703 292
366 2163
987 509
292 503
151 1398
354 1683
1840 470
339 2265
339 275
1193 3334
536 306
1011 312
825 421
463 1308
1703 288
943 310
347 455
256 2344
2769 328
3450 1745
524 277
1701 487
347 930
308 166
3347 3234
292 1993
302 291
2849 812
337 810
522 642
1503 321
380 276
1680 1707
45 1557
273 1419
386 2203
386 1460
1527 260
273 736
349 343
373 353
1089 2910
374 388
281 175
627 1576
501 294
629 633
178 807
2280 10
1241 778
277 628
1650 2780
1992 1005
1591 294
406 1264
834 3145
3041 3144
942 366
818 312
273 337
407 1402
292 312
1902 311
173 713
162 310
2032 333
385 1212
41 58
947 1342
314 455
1108 2540
350 294
715 1235
2882 278
406 302
457 1868
614 1398
447 621
1195 603
457 383
350 291
334 276
510 1424
900 828
133 642
893 184
304 884
733 274
493 711
317 573
291 1084
272 2735
1741 490
347 337
581 1471
281 1413
281 161
330 852
295 274
645 320
284 605
263 152
312 290
296 652
292 563
400 578
670 1020
376 419
45 291
408 394
907 547
2502 2502
294 2750
1429 116
908 32
769 500
360 284
1485 1185
615 320
423 739
279 881
443 881
482 371
317 487
868 890
1347 278
385 415
346 1640
473 133
687 277
135 1243
281 1502
1132 326
520 335
280 1349
1619 273
314 3012
2635 1539
384 277
284 830
1685 3226
1627 776
1124 390
1352 1592
133 388
732 875
439 1140
618 1130
1281 276
553 938
277 1792
338 273
347 1396
292 306
262 1147
1074 3237
379 1730
482 1687
373 336
1065 785
301 152
168 466
354 334
374 2276
303 1211
319 395
45 274
373 1260
292 443
707 880
348 312
290 2024
417 3127
3028 272
360 298
606 2354
2206 766
960 10
315 421
756 861
417 279
386 288
614 318
101 1337
2593 298
998 338
168 318
1046 260
289 348
290 2327
360 535
574 500
298 1250
2699 768
535 609
336 969
1162 1250
2221 689
101 100
2459 356
527 478
393 274
712 2535
2332 2721
401 1260
317 310
293 406
3151 278
297 507
613 291
1235 312
334 419
375 275
465 2064
289 1961
899 288
298 1008
774 276
317 942
304 1156
608 377
296 1781
824 426
1247 613
174 755
1351 2342
472 438
384 613
1086 376
297 1212
540 1020
391 2009
399 406
2802 97
3665 102
3666 1543
3667 1543
3668 124
260 2880
1436 342
1801 358
831 294
296 154
1280 1095
274 325
599 170
363 824
322 456
399 844
645 777
274 2734
299 3519
262 993
274 1563
1213 1005
555 143
1736 953
968 390
2551 342
259 44
343 507
327 1131
275 2614
345 135
552 708
162 361
895 428
333 896
367 896
309 32
359 294
531 330
543 833
2095 277
348 272
307 559
501 366
267 154
968 170
41 678
296 829
748 312
44 600
363 653
995 323
481 3323
711 266
3718 2758
933 709
647 377
1638 1484
744 430
331 274
306 288
396 395
1296 1102
301 1113
347 2668
386 380
459 1157
968 172
536 470
302 324
41 426
1320 272
3335 302
260 866
393 1794
417 1631
3740 289
538 1370
820 284
1409 312
535 556
1106 295
317 605
903 295
336 1443
1304 288
655 532
574 3118
297 1572
350 380
750 1633
770 344
2001 830
287 913
289 322
745 852
666 295
1215 607
767 172
495 276
523 326
2649 1931
318 310
279 288
627 1664
1340 861
986 288
293 272
2625 421
99 105
1111 1659
297 488
326 921
292 502
374 288
416 168
349 690
454 300
319 1146
275 3632
337 524
368 294
297 2227
408 172
609 279
297 294
528 291
306 579
401 336
10 317
1455 1645
1010 171
280 1113
607 3626
275 302
1011 2103
939 777
649 1008
1758 1118
296 1156
258 2223
105 97
272 1396
1899 1218
711 272
368 753
2154 1142
2601 1038
183 3057
46 323
614 275
555 135
624 1715
749 358
627 1038
403 1791
570 329
167 1424
319 291
661 274
968 171
323 2891
265 803
333 833
817 324
614 1760
763 272
2742 325
1793 1472
464 596
623 348
769 663
294 318
397 1256
293 2331
293 1059
289 517
278 623
1169 453
280 159
620 862
620 982
270 1091
1101 265
555 154
105 118
97 103
97 109
350 899
568 284
1699 288
2339 289
609 950
370 272
314 676
184 303
387 2556
670 2688
1216 321
796 3721
3864 365
45 272
583 460
1493 740
579 341
575 323
292 886
645 318
333 1459
294 1512
698 272
384 32
318 681
400 185
616 323
721 516
183 414
337 2826
552 992
380 318
274 812
497 2581
1519 1452
262 1014
471 1090
1343 730
292 272
496 1172
523 930
1427 569
377 291
262 989
1244 912
338 289
350 3349
876 826
1010 168
1017 365
1850 459
368 338
260 388
418 289
345 166
260 677
1002 2523
696 625
387 895
1136 321
1023 1506
321 313
139 321
265 630
321 289
281 1478
637 720
457 1956
82 101
99 101
314 380
270 815
1203 32
102 1057
276 388
137 961
595 358
336 2346
400 2059
697 312
260 836
903 276
987 567
292 2217
291 288
772 886
2715 1785
533 272
3627 173
10 292
280 161
334 2768
349 456
1538 1019
1282 3469
3947 3634
796 2435
290 938
296 178
507 704
970 288
296 176
388 274
260 302
339 1389
351 300
416 172
292 2040
356 451
354 2278
374 1824
481 277
2661 295
2341 376
260 488
1520 2797
293 827
789 872
1415 1008
2358 1057
1061 359
298 329
1317 810
1069 3810
3299 3501
2477 3164
1489 1095
373 1149
297 2479
999 2190
1019 324
275 380
270 701
553 473
296 171
555 444
138 2326
788 557
2289 3686
795 688
535 633
378 164
1624 1006
2424 276
10 1176
1001 358
960 1882
284 338
325 387
727 453
835 431
978 279
821 1630
292 1328
662 594
302 660
354 1361
990 174
400 173
373 1035
321 478
262 58
400 164
596 709
1129 1695
988 426
840 278
357 182
290 1480
397 311
384 334
548 800
49 57
32 79
919 953
304 1368
1469 1835
581 2100
1617 277
339 859
319 2808
1930 349
318 294
1446 2833
581 3063
484 1512
267 175
1714 782
3874 295
2765 312
324 603
305 1286
355 1314
388 839
1836 2728
600 621
1366 171
414 413
3571 434
310 1279
353 1893
1131 170
1808 2772
317 1435
1521 274
772 767
381 175
277 708
294 287
174 605
273 2560
367 1724
658 2083
640 288
439 2348
646 288
497 314
661 912
1105 783
316 256
290 273
931 711
406 420
620 655
447 616
312 288
2524 647
1767 709
274 516
681 284
377 3589
407 2650
1017 1146
2080 277
357 156
314 311
1055 325
277 483
854 3033
274 329
1482 438
117 108
85 110
342 789
1526 1285
455 1208
407 2530
279 295
337 406
175 466
374 1210
456 843
986 2176
1124 174
346 509
45 359
1120 647
645 322
314 774
435 419
278 298
265 793
393 276
532 402
317 871
184 284
291 504
406 272
481 2230
3382 487
756 294
353 742
272 288
1292 720
116 1015
1003 1126
1028 777
515 613
32 65
426 284
465 1025
575 635
385 288
890 292
1705 1257
10 2317
985 288
2008 1218
473 1107
480 1357
1999 310
439 300
1055 3052
320 358
319 300
632 981
224 164
757 2796
4150 3785
475 329
377 288
172 460
2542 1423
272 287
618 1163
480 1125
447 1137
314 3982
350 338
876 1097
326 1831
482 470
2048 265
522 298
623 2050
388 983
1020 622
625 277
1529 545
311 502
706 2733
263 331
262 1490
396 796
297 712
274 2738
324 295
354 2323
355 1328
386 284
599 171
629 925
2249 544
589 174
1018 649
356 1609
724 2488
615 754
462 800
297 312
300 413
2895 394
484 311
901 395
1917 358
1507 1831
358 258
292 1843
526 388
258 701
173 322
472 573
457 417
41 319
292 881
1216 905
265 769
10 2752
858 2068
1517 2259
355 965
657 2572
3431 342
455 2016
385 1383
893 172
1220 1442
266 362
577 437
422 1092
296 151
825 2575
355 324
682 1888
1611 1404
346 359
682 442
10 535
586 287
267 1716
291 329
435 913
168 1189
346 1106
1213 342
918 713
155 283
646 573
1750 437
358 650
531 277
3884 3446
4049 3885
493 366
305 1349
580 621
486 2266
943 692
283 295
589 182
2888 1102
1667 1794
927 312
1955 425
496 344
312 585
339 2701
3227 2220
379 289
1345 351
262 714
45 875
1854 843
338 1724
2832 527
411 348
274 279
297 1597
347 2521
292 2107
685 302
662 329
558 1452
416 167
818 711
290 1318
730 351
3361 1283
2036 384
298 294
1226 278
347 1698
483 2757
754 291
416 169
780 2000
375 507
336 784
561 1989
347 2463
278 290
302 311
260 272
350 806
436 1476
655 442
406 2037
274 278
374 348
277 879
3471 784
752 2788
314 1094
533 284
262 1265
756 330
418 2118
32 77
2952 119
108 908
3327 1715
668 532
386 2632
317 2525
277 348
259 39
1590 1231
1340 279
1528 265
346 314
357 444
337 1649
276 358
552 1618
276 278
276 313
486 356
314 272
373 391
277 288
288 409
1321 2114
653 2192
302 1389
1017 3265
1740 273
303 528
4339 609
1199 278
544 276
283 1354
1143 329
315 414
276 274
319 267
265 639
276 406
731 274
281 1286
585 841
3466 2874
511 276
786 289
346 726
952 1569
293 3154
774 288
546 1630
1253 1238
41 639
1233 174
291 3945
34 678
1858 467
2270 272
627 1192
318 735
389 745
1999 1184
2141 348
387 1358
442 1211
2528 1513
170 643
292 1759
348 324
373 3974
287 45
627 2970
525 294
269 152
612 359
45 972
1119 785
291 275
541 383
496 365
306 442
353 2324
1294 2192
1624 272
290 867
376 272
793 376
292 2609
374 312
3074 3694
3832 415
472 2676
357 133
523 513
484 306
93 93
453 295
278 388
1987 711
1428 688
483 311
334 292
946 279
1052 1691
601 941
367 348
484 326
385 712
2564 828
166 273
273 676
319 798
272 1698
547 935
1775 1659
259 769
114 1534
10 298
902 925
1499 172
876 2566
407 3085
384 376
380 274
1002 395
278 317
434 164
1760 532
436 532
543 363
403 1398
736 342
349 260
659 945
363 900
363 1187
1168 868
2921 278
346 2062
439 431
477 310
1691 710
302 338
946 294
1591 402
456 320
160 295
1813 921
287 2105
2838 1307
559 328
1552 915
2343 459
2097 745
1032 3011
386 307
314 310
2480 278
520 1319
2398 543
575 621
3205 466
1716 272
268 159
541 260
580 323
455 370
821 1376
44 590
355 1481
46 802
1258 1115
1320 291
345 271
573 289
1418 3352
347 3904
934 272
281 135
363 589
480 2559
552 551
3303 272
732 447
931 338
357 164
291 476
1973 603
677 1416
45 535
377 1289
294 443
173 466
1303 442
1973 272
296 597
399 413
305 3132
322 462
325 408
3773 278
498 515
1495 398
1615 115
958 68
116 3256
676 577
581 517
272 716
846 1043
522 1525
319 272
400 182
367 3131
10 290
606 377
1568 1568
1073 678
386 3038
464 463
290 3948
4337 343
1441 532
346 2253
397 892
327 1147
327 1239
339 2015
293 2462
1764 476
524 265
464 480
351 2869
856 284
484 859
317 349
402 2959
313 3266
547 291
2148 513
818 1855
566 294
1293 299
134 430
373 337
398 406
317 1561
1852 2660
267 332
1160 1404
3644 321
342 276
310 279
531 295
422 1283
376 549
290 1923
1635 3025
347 517
290 481
260 2660
1852 287
139 1465
3050 494
1044 330
3973 273
1988 680
346 1784
658 260
508 299
2406 4311
1087 643
339 2725
1087 1212
3646 822
1726 4152
69 1202
4586 1103
415 1464
10 454
477 2155
280 743
2082 916
387 279
443 1362
1479 460
437 184
1281 1064
2669 778
416 170
1000 2976
1438 358
296 1802
853 440
601 694
266 652
1944 828
376 284
279 389
807 322
751 326
1149 1321
940 650
324 357
526 1876
497 1695
406 415
546 273
293 322
586 360
802 621
3989 2014
355 306
723 302
301 410
301 150
91 91
117 109
322 380
268 164
382 3408
658 734
1842 961
387 311
259 59
3309 274
3068 1989
854 503
399 1397
309 40
468 493
164 279
687 279
258 962
347 1925
1455 829
559 277
292 765
256 153
415 649
472 1155
610 428
116 105
103 117
10 452
2301 299
703 317
401 1035
355 498
314 470
292 2303
170 663
2914 275
489 1090
1129 1204
655 847
971 1406
4029 1299
445 447
1748 2756
292 2304
673 325
338 314
488 470
1346 1063
360 314
355 1362
546 289
537 621
298 310
510 2762
457 880
317 524
676 275
293 1477
563 272
297 365
601 430
526 267
581 928
465 294
1132 318
2694 1006
1617 272
614 4245
310 772
306 730
319 2698
2636 1609
280 815
463 2453
426 291
537 1137
525 442
496 1618
270 1413
942 284
411 310
317 3013
402 975
2930 334
415 287
1700 1032
1168 274
479 2640
723 511
687 981
360 533
403 2399
45 447
505 310
1167 1152
355 1647
4450 2774
535 2144
782 358
2644 453
330 398
819 443
1703 348
1089 1101
399 366
1272 279
1929 2062
292 1317
1705 914
2282 3752
268 174
279 1367
443 694
1937 700
2244 2939
292 539
279 417
1994 532
292 2002
555 156
277 775
970 826
754 349
403 2351
301 171
296 1162
422 288
1856 273
292 2093
1732 806
992 358
909 1561
395 166
899 272
292 681
475 1744
2180 1983
290 451
704 1072
395 156
398 311
324 415
397 299
630 511
343 272
307 288
821 2068
647 288
301 332
260 326
333 669
1055 343
100 97
118 105
3198 32
357 469
568 311
292 484
328 442
687 1197
301 161
284 306
318 806
349 1064
384 714
796 425
376 277
318 521
276 329
2890 2230
454 295
752 324
1028 513
1591 812
283 288
987 287
524 295
305 152
602 527
339 1599
277 284
441 274
372 175
3240 1231
276 330
469 334
347 307
472 272
559 291
291 449
1475 961
1021 279
319 796
2862 488
287 365
317 3487
336 3488
3583 772
898 3267
508 1702
1129 3384
491 295
1057 108
821 289
293 2006
350 462
1268 284
484 1480
1468 1193
381 1319
144 584
725 295
635 292
635 353
391 1649
290 3230
973 283
290 467
284 330
535 996
317 3652
313 806
2089 1378
317 3159
1883 2075
1309 109
260 647
173 315
206 177
814 554
887 349
889 338
488 532
349 1181
3162 456
72 3972
813 276
279 4579
295 886
1117 2153
964 32
347 2450
121 4580
4869 1911
4870 291
4871 4423
1397 623
305 1413
397 895
463 1197
465 671
2973 307
314 1184
10 256
456 4172
820 303
182 688
357 176
298 734
387 1870
542 1348
632 284
41 360
1009 279
289 1207
508 272
401 32
316 502
471 273
903 322
360 277
618 355
97 112
10 277
824 32
835 655
357 154
2127 338
794 1058
3411 1879
400 538
809 267
347 1313
1087 500
4413 1795
670 487
998 1050
893 133
2421 956
276 279
1030 395
355 1843
1182 349
327 34
291 2489
83 116
101 1111
298 272
2294 3317
814 1243
1641 276
307 531
369 3076
2090 1442
670 583
577 275
422 936
397 2918
541 485
336 454
366 2102
817 783
387 892
464 1670
422 3094
274 265
317 562
2763 2296
295 666
1304 570
292 1610
548 2104
304 1390
2302 295
291 800
372 841
273 789
642 287
722 370
2487 1818
774 3103
423 272
502 278
423 1098
4463 1943
346 277
614 515
310 310
331 312
59 553
267 1077
310 273
1672 172
4054 466
347 288
1233 171
44 537
266 1091
296 2012
259 746
2399 686
396 1140
839 276
1138 355
292 2400
1643 3582
10 334
259 439
636 294
302 3061
292 324
4727 283
172 485
385 871
290 3587
272 307
307 1126
1305 640
290 3902
1619 585
375 273
182 742
2286 1646
329 272
3358 168
185 272
397 715
347 453
1643 2640
568 303
1394 277
1455 1502
354 517
