224 166
224 167
32 256
256 190
256 176
257 141
257 135
261 256
256 191
259 256
264 256
260 258
256 168
175 256
262 258
262 256
269 188
257 129
256 164
261 260
256 149
256 178
256 172
259 258
262 267
263 175
164 258
257 128
256 272
256 174
257 139
224 165
265 168
260 263
264 258
256 184
258 184
266 149
258 172
259 260
258 149
170 275
287 282
256 159
256 130
263 164
259 267
256 166
256 170
44 258
256 151
256 163
265 178
258 143
263 172
256 185
263 159
265 272
266 272
32 257
257 130
262 268
287 164
256 182
257 131
265 174
258 170
296 260
266 178
278 300
266 164
258 133
266 168
185 284
265 172
299 290
265 184
256 135
271 182
256 173
263 269
256 167
167 257
265 149
258 174
256 156
263 183
258 166
265 166
257 166
258 168
271 149
271 155
32 32
149 260
265 164
273 277
266 282
270 172
266 184
258 297
268 263
258 134
256 154
318 10
265 156
258 182
266 172
258 185
283 284
259 289
264 267
266 182
291 263
258 176
143 276
309 325
183 312
32 40
270 184
258 147
161 256
262 298
315 338
320 274
256 165
258 164
377 188
265 135
258 156
280 184
270 170
256 150
265 151
265 185
271 178
262 260
258 151
263 166
263 170
175 257
276 342
143 325
266 156
258 137
266 174
265 167
263 154
256 183
258 175
271 150
258 173
273 276
265 170
268 281
289 172
265 130
273 260
303 263
279 329
32 10
257 136
280 174
268 301
165 347
226 128
283 274
266 166
292 285
256 175
289 164
274 301
286 306
292 308
270 134
306 352
369 165
256 147
256 171
322 260
371 331
257 338
414 167
270 133
153 263
349 349
256 383
336 172
170 260
263 158
266 183
279 172
295 307
273 268
256 155
266 173
337 281
263 282
258 329
280 172
263 178
263 168
256 137
261 267
258 135
264 260
348 324
262 305
289 165
263 161
285 288
270 297
335 330
270 164
271 164
298 143
155 324
270 149
283 268
258 150
271 172
265 165
309 276
265 163
265 183
258 420
440 151
315 168
445 288
279 184
271 183
292 300
271 159
256 143
270 166
258 154
270 175
265 182
271 174
44 32
345 345
257 142
266 159
279 350
